#第六章 组合数据
#6.1 集合类型 set

a = {"def","def", 123,234,12,23.4,23.4,879,"123"}
print(a)
print(type(a))
#输出结果：
# {23.4, 'def', 234, 123, 12, '123', 879} 集合是无序组合，每次输出数据位置不一定完全相同
# <class 'set'>     集合元素具有独一无二性，使用集合类型能够过滤掉重复元素，只保留其中的一个

#集合的四个操作符
s = {1010,'def',111.2,'12'}
t = {1010,1010,'m2',750,1010,501.3}
#1 s和t的交集
print(s & t) #{1010}
#2 s和t的差集
print(s - t)  #{'12', 'def', 111.2}
#3 s和t的并集
print(s | t)  #{'m2', 750, 111.2, 'def', '12', 1010, 501.3}
#4 s和t的补集 （除去共同元素）
print(s ^ t)  #{'12', 750, 111.2, 'm2', 501.3, 'def'}


#2. 集合类型常用的操作函数或方法

b = {1010,'python',78.9,'550'}
b.add('人工智能')
print(b)  #{'550', 78.9, 1010, '人工智能', 'python'}

b.remove(1010)
print(b) #{'人工智能', 78.9, 'python', '550'}

print(len(b)) #4

print(1010 in b) #False

print(1010 not in b)  #True

b.clear()
print(b) #set()

#3 set() 将其他组合数据变成集合类型
m = '知之为知之，不知为不知'
print(set(m)) #{'知', '之', '，', '不', '为'}
n = set() #set()函数也可以生成空集合变量
print(n)  #set()