#6.5 字典 {键1:值1, 键2:值2, … , 键n:值n}
#1 Python语言中的字典使用大括号{}建立，每个元素是一个键值对。键值对之间没有顺序且不能重复！
d1 = {'两弹元勋':'邓稼先', "青蒿素":'屠呦呦', '水稻之父':'袁隆'}
print(d1,type(d1))
#{'两弹元勋': '邓稼先', '青蒿素': '屠呦呦', '水稻之父': '袁隆'} <class 'dict'>

#2字典如何索引：d[键]
print(d1['两弹元勋']) #邓稼先

#3 利用索引和赋值 = 配合，可以对字典中每个元素进行修改。
#如：d1里面，{'水稻之父':'袁隆} 少打一个 平 字，如何修改？
d1['水稻之父'] = '袁隆平'
print(d1)  #{'两弹元勋': '邓稼先', '青蒿素': '屠呦呦', '水稻之父': '袁隆平'}

#4 使用大括号可以创建字典。通过索引和赋值配合，可以向字典中增加元素。
d2 = {}
d2[201804] = "小新"
d2[201805] = "小明"
print(d2) #{201804: '小新', 201805: '小明'}
d2[201804] = "小新2"
print(d2)  #{201804: '小新2', 201805: '小明'} '小新'被 '小新2'覆盖
