#7.4 二维数据的储存

#1.二维数据写为.csv文件 （通过"x".join()函数）
# ls=[['指标', '2014年', '2015年', '2016年'], ['居民消费价格指数', '102', '101.4', '102'], ['食品', '103.1', '102.3', '104.6'], ['烟酒及用品', '99.4', '102.1', '101.5'], ['衣着', '102.4', '102.7', '101.4'], ['家庭设备用品', '101.2', '101', '100.5'],
#     ['医疗保健和个人用品', '101.3', '102', '101.1'], ['交通和通信', '99.9', '98.3', '98.7'],
#     ['娱乐教育文化', '101.9', '101.4', '101.6'], ['居住', '102', '100.7', '101.6']]
# f1 = open('/Users/teresa624/Documents/Coding/Python中文网课（淘宝凡博）/Python 编程+办公自动化（凡博网课）/上课随练code/第七章/cpi.csv','w')
# for row in ls:
#     f1.write(",".join(row)+"\n") #结尾加上'\n'：写完一行回车下一行，再继续写。（便于让计算机和读者识别出表格有几行）
# f1.close()

#2.csv文件还原为数据
f = open('/Users/teresa624/Documents/Coding/Python中文网课（淘宝凡博）/Python 编程+办公自动化（凡博网课）/上课随练code/第七章/cpi.csv','r')
ls = list()
for line in f:
    a=line.strip('\n')
    b=a.split(",")
    ls.append(b)
    #这三行代码（16-18）相当于：
    # ls.append(line.strip("\n").split(","))
print(ls)
f.close()